#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.suffix: Refreshing state... [id=bQQwQBpH]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a026c0f1f61660bf]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=education-eks-bQQwQBpH20210318015447420800000001]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::984102645395:policy/education-eks-bQQwQBpH-elb-sl-role-creation20210318015447423400000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e24c8961ea3c23a2]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=education-eks-bQQwQBpH20210318015447420800000001-20210318015447953100000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=education-eks-bQQwQBpH20210318015447420800000001-20210318015447928600000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=education-eks-bQQwQBpH20210318015447420800000001-20210318015447929100000005]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=education-eks-bQQwQBpH20210318015447420800000001-20210318015447925700000003]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03eb0ac01c5d4c1e3]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-036401859e0a6c00b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d69c21d25322d2e8]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0504ae5631f6a4031]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-0aacf07d586ba655d]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0972b2a476786a685]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ae6b79bfab275b1f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aadeb73cb417240a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-076f7557926f38f1f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dbb13271bdbd6972]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08ac58434f0f4721f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00ca338acc6f9ae50]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a97181bb85093647]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-055da8a905cce2264]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d69c21d25322d2e81080289494]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-635020115]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-29110968]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1638568554]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1125681317]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2223420528]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-4019992061]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c16041dff307021d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05f4bad62948b66bc]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09394b81e667efada]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-048cc71ad7c8d7831]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c976e415d1ff3a19]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a01a1f5a42b23e75]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e95a6fc57b8214e9]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-bQQwQBpH]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03eb0ac01c5d4c1e31080289494]
module.eks.null_resource.wait_for_cluster[0]: Refreshing state... [id=9078321674384843785]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051651420000000c]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=78eda666447fe85c5459bd541156084cfb0ed912]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051651420000000c-20210318020520080900000010]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051651420000000c-20210318020520091000000011]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051999830000000d]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051651420000000c-2021031802052007940000000f]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=education-eks-bQQwQBpH2021031802051999940000000e]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=education-eks-bQQwQBpH-worker-group-120210318020521457600000013]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=education-eks-bQQwQBpH-worker-group-220210318020521443300000012]
module.eks.random_pet.workers[1]: Refreshing state... [id=teaching-humpback]
module.eks.random_pet.workers[0]: Refreshing state... [id=secure-bluebird]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=education-eks-bQQwQBpH-worker-group-120210318020529951200000014]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=education-eks-bQQwQBpH-worker-group-220210318020529958600000015]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::984102645395:role/education-eks-bQQwQBpH2021031802051651420000000c"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://5374787A589EB07C46648A5D290DB86C.gr7.us-east-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ETXhPREF5TURFME1Wb1hEVE14TURNeE5qQXlNREUwTVZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTE9qCnVIcFBoMUpUbXhBb2xBR2FZbHlTSGNtRm9wclkrRVA1M1F5S3ZzVERkYmdtSjJEZ3U0endpempPVm9HYUtUL1kKcmdLVVg0WG5GMVNGUEJvMXRKMmpRT1RQTUt5YUJYUlZlZ284S2FjUWNCVnRCMzFtQ0FLVEthVGVZS2wydzVWMgo2Y1FaUXMrcTJrM3Z3b21obnkrYk1WSHliTDFRZmMwYkdtUHJSYmRvanJuNHZ5dlNxbXplOEk5Mjl2MUh1WlVCCnpLZDd3TDhVMlM4QUVHT0QrTUNaZjNBOVBoNERCTHZwR2NrN0VYaVBxN3FvdUtuU0xnS0xPd2lOTUp2SVlQMXoKcUo2YlVFc1RUTzJOekVEYm52L0p4cjVDTUpaaitYN0thaXRxdHpENDNWdmJ1SFNlZ0ZEL2Jmb1FZclRJTzdHaQp4bWp0K1FsZXBjY2VhR3pSOHJNQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFLNkhzOHQ5Sy9UaXdkUjZwYWxBL213SjQ3MWsKTFBGVXZhYWFjSEk5SW5DTXpibk8rQzVzUjRDdC9SZXh0d2Ivb0lOdHdyc3hzaDhHV0pMV2k3d1BHVzU0YWpDQworYkFRTVRNMGhiamo0N0R2c1FiUnMwb2UrQTNjK1Q1VDNobDllVzAyZnc5Lzc0T0grREJMY1JJaDRwTlh1UnAyCmVQMys5Wkx5UFl5ZkxiV1lySUVZZFI0WUtNaTA4Rkx2T1JxREVScE9qVTk3YnVPZ3lJQnhOOGhaY1hqbFhIeVEKaDVKdjJ6N2RjOTdzdGhRcTZBK3FHVjNUQm11M0RySVQ5ZFJVbEl5eTg1NkdYVVF3NC81VThYU2lpTXd6OVFLYQpFN3krdHdzOFZwUi9KaGFkTmZBZ2dKV1lQNFJsQmFxK01rTm9uMzhvZ2luanVUYkUrWUVZeHFpajdmOD0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
              name: eks_education-eks-bQQwQBpH
            
            contexts:
            - context:
                cluster: eks_education-eks-bQQwQBpH
                user: eks_education-eks-bQQwQBpH
              name: eks_education-eks-bQQwQBpH
            
            current-context: eks_education-eks-bQQwQBpH
            
            users:
            - name: eks_education-eks-bQQwQBpH
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "education-eks-bQQwQBpH"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./kubeconfig_education-eks-bQQwQBpH"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @jonathanbaraldi, Action: `pull_request`*